Revit 2022 API
RebarBarType.BarDiameter Property
 Defines bar model diameter of rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")]
public double BarDiameter { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")> _
Public Property BarDiameter As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and may be removed in a later version of Revit. It returns the BarModelDiameter. We suggest you replace it with BarModelDiameter or BarNominalDiameter property instead, depending on your needs.")]
public:
property double BarDiameter {
	double get ();
	void set (double value);
}
Field Value
 The bar model diameter of rebar
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the bar diameter barDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter, standard hook bend diameter and stirrup/tie bend diameter
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace